export const iranProvinces = [
  {
    province: 'آذربایجان شرقی',
    cities: ['تبریز', 'مراغه', 'میانه', 'مرند', 'اهر', 'بناب', 'سراب', 'شبستر', 'هریس', 'بستان‌آباد', 'آذرشهر', 'اسکو', 'هشترود', 'کلیبر', 'ورزقان', 'جلفا', 'چاراویماق', 'ملکان', 'عجب‌شیر'],
  },
  {
    province: 'آذربایجان غربی',
    cities: ['ارومیه', 'خوی', 'مهاباد', 'بوکان', 'میاندوآب', 'سلماس', 'پیرانشهر', 'نقده', 'ماکو', 'شاهین‌دژ', 'سردشت', 'تکاب', 'چالدران', 'پلدشت', 'چایپاره', 'اشنویه'],
  },
  {
    province: 'اردبیل',
    cities: ['اردبیل', 'مشگین‌شهر', 'پارس‌آباد', 'خلخال', 'بیله‌سوار', 'گرمی', 'نمین', 'نیر', 'کوثر', 'سرعین'],
  },
  {
    province: 'اصفهان',
    cities: ['اصفهان', 'کاشان', 'نجف‌آباد', 'خمینی‌شهر', 'شاهین‌شهر', 'نطنز', 'گلپایگان', 'فلاورجان', 'مبارکه', 'لنجان (زرین‌شهر)', 'سمیرم', 'نائین', 'اردستان', 'آران و بیدگل', 'شهرضا', 'فریدن', 'فریدون‌شهر', 'تیران و کرون', 'خوانسار', 'دهاقان', 'برخوار'],
  },
  {
    province: 'البرز',
    cities: ['کرج', 'فردیس', 'نظرآباد', 'هشتگرد (ساوجبلاغ)', 'اشتهارد', 'طالقان', 'چهارباغ'],
  },
  {
    province: 'ایلام',
    cities: ['ایلام', 'دهلران', 'آبدانان', 'ایوان', 'دره‌شهر', 'مهران', 'چرداول (سرابله)', 'بدره', 'ملکشاهی', 'سیروان'],
  },
  {
    province: 'بوشهر',
    cities: ['بوشهر', 'برازجان (دشتستان)', 'گناوه', 'کنگان', 'دیلم', 'دیر', 'جم', 'تنگستان (اهرم)', 'خورموج (دشتی)', 'عسلویه'],
  },
  {
    province: 'تهران',
    cities: ['تهران', 'ری', 'اسلامشهر', 'شهریار', 'ورامین', 'پاکدشت', 'رباط‌کریم', 'ملارد', 'پردیس', 'دماوند', 'فیروزکوه', 'قدس', 'باقرشهر', 'پیشوا', 'قرچک', 'بومهن', 'لواسان', 'کهریزک', 'نسیم‌شهر', 'صالح‌آباد', 'اندیشه'],
  },
  {
    province: 'چهارمحال و بختیاری',
    cities: ['شهرکرد', 'بروجن', 'فارسان', 'لردگان', 'سامان', 'اردل', 'کوهرنگ', 'کیار', 'بن'],
  },
  {
    province: 'خراسان جنوبی',
    cities: ['بیرجند', 'قاینات (قائن)', 'فردوس', 'نهبندان', 'طبس', 'سربیشه', 'بشرویه', 'درمیان', 'زیرکوه', 'خوسف'],
  },
  {
    province: 'خراسان رضوی',
    cities: ['مشهد', 'نیشابور', 'سبزوار', 'تربت‌حیدریه', 'قوچان', 'کاشمر', 'تربت‌جام', 'چناران', 'گناباد', 'فریمان', 'تایباد', 'سرخس', 'درگز', 'خواف', 'بردسکن', 'فیض‌آباد', 'بجستان', 'رشتخوار', 'خلیل‌آباد', 'مه‌ولات'],
  },
  {
    province: 'خراسان شمالی',
    cities: ['بجنورد', 'شیروان', 'اسفراین', 'جاجرم', 'فاروج', 'مانه و سملقان', 'گرمه', 'رازوجرگلان'],
  },
  {
    province: 'خوزستان',
    cities: ['اهواز', 'آبادان', 'خرمشهر', 'دزفول', 'اندیمشک', 'بهبهان', 'شوشتر', 'ماهشهر', 'ایذه', 'باغ‌ملک', 'رامهرمز', 'شوش', 'مسجدسلیمان', 'هندیجان', 'هویزه', 'دشت‌آزادگان', 'گتوند', 'لالی', 'امیدیه', 'حمیدیه', 'شادگان', 'رامشیر', 'آغاجاری'],
  },
  {
    province: 'زنجان',
    cities: ['زنجان', 'ابهر', 'خرمدره', 'قیدار (خدابنده)', 'ماه‌نشان', 'طارم', 'ایجرود', 'سلطانیه'],
  },
  {
    province: 'سمنان',
    cities: ['سمنان', 'شاهرود', 'دامغان', 'گرمسار', 'مهدی‌شهر', 'میامی', 'سرخه', 'آرادان'],
  },
  {
    province: 'سیستان و بلوچستان',
    cities: ['زاهدان', 'زابل', 'ایرانشهر', 'چابهار', 'سراوان', 'خاش', 'کنارک', 'نیک‌شهر', 'سرباز', 'هیرمند', 'میرجاوه', 'زهک', 'دلگان', 'فنوج', 'قصرقند'],
  },
  {
    province: 'فارس',
    cities: ['شیراز', 'مرودشت', 'جهرم', 'کازرون', 'فسا', 'لار', 'داراب', 'آباده', 'اقلید', 'لامرد', 'فیروزآباد', 'استهبان', 'نی‌ریز', 'سپیدان', 'زرین‌دشت', 'خرامه', 'کوار', 'ارسنجان', 'بوانات', 'مهر', 'گراش', 'خنج'],
  },
  {
    province: 'قزوین',
    cities: ['قزوین', 'تاکستان', 'البرز (محمدیه)', 'بوئین‌زهرا', 'آبیک', 'آوج', 'الموت'],
  },
  {
    province: 'قم',
    cities: ['قم'],
  },
  {
    province: 'کردستان',
    cities: ['سنندج', 'سقز', 'مریوان', 'بانه', 'قروه', 'کامیاران', 'بیجار', 'دیواندره', 'دهگلان', 'سروآباد'],
  },
  {
    province: 'کرمان',
    cities: ['کرمان', 'رفسنجان', 'سیرجان', 'جیرفت', 'بم', 'زرند', 'کهنوج', 'بافت', 'شهربابک', 'بردسیر', 'راور', 'ارزوئیه', 'عنبرآباد', 'منوجان', 'رودبار جنوب', 'فهرج', 'قلعه‌گنج', 'انار'],
  },
  {
    province: 'کرمانشاه',
    cities: ['کرمانشاه', 'اسلام‌آباد غرب', 'سنقر', 'کنگاور', 'هرسین', 'پاوه', 'سرپل ذهاب', 'صحنه', 'گیلانغرب', 'جوانرود', 'قصرشیرین', 'روانسر', 'ثلاث باباجانی'],
  },
  {
    province: 'کهگیلویه و بویراحمد',
    cities: ['یاسوج', 'گچساران (دوگنبدان)', 'دهدشت', 'دیشموک', 'لنده', 'باشت', 'چرام'],
  },
  {
    province: 'گلستان',
    cities: ['گرگان', 'گنبد کاووس', 'علی‌آباد کتول', 'آق‌قلا', 'کردکوی', 'بندر ترکمن', 'مینودشت', 'کلاله', 'رامیان', 'آزادشهر', 'گالیکش', 'بندرگز', 'گمیشان'],
  },
  {
    province: 'گیلان',
    cities: ['رشت', 'انزلی', 'لاهیجان', 'لنگرود', 'آستارا', 'تالش', 'رودسر', 'صومعه‌سرا', 'فومن', 'رودبار', 'آستانه‌اشرفیه', 'شفت', 'ماسال', 'املش', 'سیاهکل', 'رضوانشهر'],
  },
  {
    province: 'لرستان',
    cities: ['خرم‌آباد', 'بروجرد', 'دورود', 'الیگودرز', 'کوهدشت', 'ازنا', 'پلدختر', 'الشتر', 'نورآباد (دلفان)', 'رومشکان', 'چگنی'],
  },
  {
    province: 'مازندران',
    cities: ['ساری', 'بابل', 'آمل', 'قائم‌شهر', 'بهشهر', 'تنکابن', 'چالوس', 'نوشهر', 'بابلسر', 'نور', 'محمودآباد', 'فریدونکنار', 'جویبار', 'نکا', 'سوادکوه', 'رامسر', 'عباس‌آباد', 'گلوگاه', 'میاندورود', 'سیمرغ', 'کلاردشت'],
  },
  {
    province: 'مرکزی',
    cities: ['اراک', 'ساوه', 'خمین', 'محلات', 'دلیجان', 'تفرش', 'آشتیان', 'شازند', 'کمیجان', 'زرندیه', 'فراهان'],
  },
  {
    province: 'هرمزگان',
    cities: ['بندرعباس', 'میناب', 'قشم', 'بندرلنگه', 'رودان', 'حاجی‌آباد', 'بستک', 'پارسیان', 'جاسک', 'ابوموسی', 'خمیر', 'سیریک'],
  },
  {
    province: 'همدان',
    cities: ['همدان', 'ملایر', 'نهاوند', 'تویسرکان', 'اسدآباد', 'کبودرآهنگ', 'رزن', 'بهار', 'فامنین'],
  },
  {
    province: 'یزد',
    cities: ['یزد', 'میبد', 'اردکان', 'بافق', 'ابرکوه', 'مهریز', 'تفت', 'اشکذر', 'خاتم (هرات)', 'بهاباد'],
  },
]
